const skillsSummary = [{
			"name": "Владение мечами",
			"id": "swordSkills",
			"iconUrl": "",
			"type": "warrior",
			"contentNoob": " Каждый уровень навыка увеличивает наносимый мечами урон на 2%.",
			"contentExpert": " Каждый уровень навыка увеличивает наносимый мечами урон на 3%.",
			"contentMaster": "Каждый уровень навыка увеличивает наносимый мечами урон на 4% и дополнительно повышает урон на 15 (за каждый уровень навыка) если используется один меч, и на 25, если используются два."
		}, {
			"name": "Владение топорами",
			"id": "axeSkills",
			"iconUrl": "",
			"type": "warrior",
			"contentNoob": " Каждый уровень навыка увеличивает наносимый топорами урон на 2%.",
			"contentExpert": " Каждый уровень навыка увеличивает наносимый топорами урон на 3%.",
			"contentMaster": "Каждый уровень навыка увеличивает наносимый топорами урон на 4% и дополнительно повышает урон на 15 (за каждый уровень навыка) если используется один топор, и на 25, если используются два."
		}, {
			"name": "Владение копьями",
			"id": "spearSkills",
			"iconUrl": "",
			"type": "warrior",
			"contentNoob": " Каждый уровень навыка увеличивает наносимый копьями урон на 2%.",
			"contentExpert": " Каждый уровень навыка увеличивает наносимый копьями урон на 3%.",
			"contentMaster": "Каждый уровень навыка увеличивает наносимый копьями урон на 4% и дополнительно повышает урон на 20 (за каждый уровень навыка)."
		}, {
			"name": "Владение луками",
			"id": "bowSkills",
			"iconUrl": "",
			"type": "warrior",
			"contentNoob": " Каждый уровень навыка увеличивает наносимый луками урон на 2%.",
			"contentExpert": " Каждый уровень навыка увеличивает наносимый луками урон на 3%.",
			"contentMaster": "Каждый уровень навыка увеличивает наносимый луками урон на 4% и дополнительно повышает урон на 15 (за каждый уровень навыка)."
		}, {
			"name": "Владение арбалетами",
			"id": "crossbowSkills",
			"iconUrl": "",
			"type": "warrior",
			"contentNoob": " Каждый уровень навыка увеличивает наносимый арбалетами урон на 2%.",
			"contentExpert": " Каждый уровень навыка увеличивает наносимый арбалетами урон на 3%.",
			"contentMaster": "Каждый уровень навыка увеличивает наносимый арбалетами урон на 4% и дополнительно повышает урон на 15 (за каждый уровень навыка)."
		}, {
			"name": "Владение дубинами",
			"id": "batSkills",
			"iconUrl": "",
			"type": "warrior",
			"contentNoob": " Каждый уровень навыка увеличивает наносимый дубинами урон на 2%.",
			"contentExpert": " Каждый уровень навыка увеличивает наносимый дубинами урон на 3%.",
			"contentMaster": "Каждый уровень навыка увеличивает наносимый дубинами урон на 4% и дополнительно повышает урон на 15 (за каждый уровень навыка) если используется одна дубина, и на 25, если используются две."
		}, {
			"name": "Магия стихий",
			"id": "elementSkills",
			"iconUrl": "",
			"type": "magic",
			"contentNoob": "Магия призыва элементов и нанесения прямого урона стихиями. Увеличивает урон, наносимый заклинаниями этой школы на 2% за уровень навыка. Позволяет изучать базовые заклинания этой школы.",
			"contentExpert": "Увеличивает урон, наносимый заклинаниями этой школы на 2% за уровень навыка. Позволяет изучать экспертные заклинания и дополнительно увеличивает урон заклинаний этой школы на 10%. Повышает урон, наносимый монстрам на 20%.",
			"contentMaster": "Увеличивает урон, наносимый заклинаниями этой школы на 2% за уровень навыка. Позволяет изучать мастерские заклинания и дополнительно увеличивает урон заклинаний этой школы на 20%. Повышает урон, наносимый монстрам на 40%."
		}, {
			"name": "Магия разума",
			"id": "mindSkills",
			"iconUrl": "",
			"type": "magic",
			"contentNoob": "Магия воздействия на разум и сознание противника. Увеличивает продолжительность действия заклинаний этой школы на 2% за уровень навыка. Позволяет изучать базовые заклинания этой школы.",
			"contentExpert": "Увеличивает продолжительность действия заклинаний этой школы на 2% за уровень навыка. Позволяет изучать экспертные заклинания и дополнительно увеличивает продолжительность действия заклинаний этой школы на 10%.",
			"contentMaster": "Увеличивает продолжительность действия заклинаний этой школы на 2% за уровень навыка. Позволяет изучать мастерские заклинания и дополнительно увеличивает продолжительность действия заклинаний этой школы на 20%."
		}, {
			"name": "Магия света",
			"id": "lightSkills",
			"iconUrl": "",
			"type": "magic",
			"contentNoob": "Магия лечения и восстановления. Увеличивает продолжительность действия и эффективность лечения для заклинаний этой школы на 1% за уровень навыка. Позволяет изучать базовые заклинания этой школы.",
			"contentExpert": "Увеличивает продолжительность действия и эффективность лечения для заклинаний этой школы на 1% за уровень навыка. Позволяет изучать экспертные заклинания и дополнительно увеличивает продолжительность действия и эффективность лечения заклинаний этой школы на 10%.",
			"contentMaster": "Увеличивает продолжительность действия и эффективность лечения для заклинаний этой школы на 1% за уровень навыка. Позволяет изучать мастерские заклинания и дополнительно увеличивает продолжительность действия и эффективность лечения заклинаний этой школы на 20%."
		}, {
			"name": "Магия тьмы",
			"id": "darkSkills",
			"iconUrl": "",
			"type": "magic",
			"contentNoob": "Магия призыва существ, наложения проклятий и негативных эффектов. Увеличивает характеристики призываемых с помощью заклинаний этой школы существ на 2% за уровень навыка. Позволяет изучать базовые заклинания этой школы.",
			"contentExpert": "Увеличивает характеристики призываемых с помощью заклинаний этой школы существ на 2% за уровень навыка. Позволяет изучать экспертные заклинания, дополнительно увеличивает характеристики призываемых с помощью заклинаний этой школы существ на 10% и снижает их ОД на действие на 10%.",
			"contentMaster": "Увеличивает характеристики призываемых с помощью заклинаний этой школы существ на 2% за уровень навыка. Позволяет изучать мастерские заклинания, дополнительно увеличивает характеристики призываемых с помощью заклинаний этой школы существ на 20% и снижает их ОД на действие на 15%."
		}, {
			"name": "Владение щитами",
			"id": "shieldSkills",
			"iconUrl": "",
			"type": "warrior",
			"contentNoob": "Повышает все параметры щита (кроме ОД на действие) на 5% и увеличивает шанс отбить прошедший сквозь защиту удар любого оружия на 1% (пробивается критическими ударами, урон при этом уменьшается вдвое).",
			"contentExpert": "Повышает все параметры щита (кроме ОД на действие) на 5% и увеличивает шанс отбить прошедший сквозь защиту удар любого оружия на 2% (пробивается критическими ударами, урон при этом уменьшается вдвое).",
			"contentMaster": "Повышает все параметры щита (кроме ОД на действие) на 10% и увеличивает шанс отбить прошедший сквозь защиту удар любого оружия на 2% (пробивается критическими ударами, урон при этом уменьшается вдвое)."
		}, {
			"name": "Уворотливость",
			"id": "dodgySkills",
			"iconUrl": "",
			"type": "defence",
			"contentNoob": "Повышает защиту персонажа на 10+2% за каждый уровень навыка.",
			"contentExpert": "Повышает защиту персонажа на 15+3% за каждый уровень навыка и дает возможность с вероятностью равной (уровень навыка * 2) уклоняться от ударных заклинаний, при этом урон от них снижается в 2 раза.",
			"contentMaster": "Повышает защиту персонажа на 25+4% за каждый уровень навыка и дает возможность с вероятностью равной (уровень навыка * 4) уклоняться от ударных заклинаний, при этом урон от них снижается в 2 раза."
		}, {
			"name": "Критический удар",
			"secondName": "Палач",
			"id": "critSkills",
			"iconUrl": "",
			"type": "atack",
			"contentNoob": "Повышает вероятность критического удара на 2+1% и критический урон на +1% за уровень навыка.",
			"contentExpert": "Повышает вероятность критического удара на 5+1%, критический урон и шанс кровотечения на +1% за уровень навыка.",
			"contentMaster": "Повышает вероятность критического удара на 10+1%, критический урон и шанс кровотечения на +2% за уровень навыка."
		}, {
			"name": "Тиран",
			"secondName": "Тиран",
			"id": "critDamageSkills",
			"iconUrl": "",
			"type": "atack",
			"contentNoob": "Повышает критический урон на 2% за уровень навыка.",
			"contentExpert": "Повышает критический урон на 3% за уровень навыка.",
			"contentMaster": "Повышает критический урон на 5% за уровень навыка."
		}, {
			"name": "Громила",
			"id": "thugSkills",
			"iconUrl": "",
			"type": "atack",
			"contentNoob": "Увеличивает урон контактного оружия и арбалетов на 10+1% за каждый уровень навыка.",
			"contentExpert": "Увеличивает урон контактного оружия и арбалетов на 15+1% за каждый уровень навыка.",
			"contentMaster": "Увеличивает урон контактного оружия и арбалетов на 25+2% за каждый уровень навыка."
		}, {
			"name": "Здоровяк",
			"id": "healthSkills",
			"iconUrl": "",
			"type": "defence",
			"contentNoob": "Повышает здоровье аватара на 30+2% за уровень навыка.",
			"contentExpert": "Повышает здоровье аватара на 50+3% за уровень навыка.",
			"contentMaster": "Повышает здоровье аватара на 150+4% за уровень навыка."
		}, {
			"name": "Огненная кожа",
			"id": "fireskinSkills",
			"iconUrl": "",
			"type": "forAll",
			"contentNoob": "Возвращает каждому ударившему демона контактным оружием (4*уровень навыка)% от полученного демоном урона.",
			"contentExpert": "Возвращает каждому ударившему демона контактным оружием (5*уровень навыка)% от полученного демоном урона плюс 5*уровень навыка.",
			"contentMaster": "Возвращает каждому ударившему демона контактным оружием (7*уровень навыка)% от полученного демоном урона плюс 10*уровень навыка."
		}, {
			"name": "Вампиризм",
			"id": "vampireSkills",
			"iconUrl": "",
			"type": "forAll",
			"contentNoob": "Уникальный навык расы дану и высших форм вампир и призрак. После каждого успешного удара контактным оружием аватар восстанавливает здоровье в количестве равном (уровень навыка * 0.4)% от нанесенного урона",
			"contentExpert": "После каждого успешного удара контактным оружием аватар восстанавливает здоровье в количестве равном (уровень навыка * 0.5)% от нанесенного урона",
			"contentMaster": "После каждого успешного удара контактным оружием аватар восстанавливает здоровье в количестве равном (уровень навыка * 0.7)% от нанесенного урона"
		}, {
			"name": "Точность",
			"id": "accuracySkills",
			"iconUrl": "",
			"type": "atack",
			"contentNoob": "Повышает атаку аватара на 15+3% за каждый уровень навыка.",
			"contentExpert": "Повышает атаку аватара на 25+3% за каждый уровень навыка.",
			"contentMaster": "Повышает атаку аватара на 50+5% за каждый уровень навыка."
		}, {
			"name": "Каменная кожа",
			"id": "stoneskinSkills",
			"iconUrl": "",
			"type": "defence",
			"contentNoob": "Повышает броню аватара на 5+2% за каждый уровень навыка.",
			"contentExpert": "Повышает броню аватара на 10+2% за каждый уровень навыка.",
			"contentMaster": "Повышает броню аватара на 15+3% за каждый уровень навыка."
		}, {
			"name": "Регенерация",
			"secondName": "Жизненная сила",
			"id": "regenerationSkills",
			"iconUrl": "",
			"type": "forAll",
			"contentNoob": "Увеличивает скорость восстановления здоровья после боя на 20 + 2% в минуту за каждую единицу навыка.",
			"contentExpert": "Увеличивает скорость восстановления здоровья после боя на 30 + 3% в минуту за каждую единицу навыка. В начале каждого боя аватар получает Жажду жизни на 90 секунд.",
			"contentMaster": "Увеличивает скорость восстановления здоровья после боя на 40 + 4% в минуту за уровень навыка. В начале каждого боя аватар получает эффект заклинания Оберег света на 40 секунд. Постоянный эффект Жажда жизни в бою."
		}, {
			"name": "Двойное оружие",
			"id": "doubleSkills",
			"iconUrl": "",
			"type": "atack",
			"contentNoob": "Изначально оружие в левой руке наносит лишь 30% своего урона. Каждый уровень навыка повышает урон, оружия находящегося в левой руке, на 5%, дополнительно дает шанс с вероятностью (уровень навыка)% нанести двойной удар.",
			"contentExpert": "Каждый уровень навыка повышает урон, оружия находящегося в левой руке, на 6%, дополнительно дает шанс с вероятностью (1.5 * уровень навыка)% нанести двойной удар.",
			"contentMaster": "Каждый уровень навыка повышает урон, оружия находящегося в левой руке, на 8%, дополнительно дает шанс с вероятностью (2.5 * уровень навыка)% нанести двойной удар."
		}, {
			"name": "Медитация",
			"id": "meditationSkills",
			"iconUrl": "",
			"type": "magic",
			"contentNoob": "Увеличивает скорость восстановления маны после боя на 4 + 1% в минуту за каждую единицу навыка.",
			"contentExpert": "Увеличивает скорость восстановления маны после боя на 10 + 1% в минуту за каждую единицу навыка.",
			"contentMaster": "Увеличивает скорость восстановления маны после боя на 20 + 3% в минуту за каждую единицу навыка."
		}, {
			"name": "Быстрые рефлексы",
			"id": "fastrefSkills",
			"iconUrl": "",
			"type": "defence",
			"contentNoob": "Увеличивает парирование на 2+1% и реакцию на 1+1% за уровень навыка.",
			"contentExpert": "Увеличивает парирование на 4+2% и реакцию на 2+1% за уровень навыка. Максимальный шанс парирования становится 60% (вместо 50% по умолчанию).",
			"contentMaster": "Увеличивает парирование на 6+3% и реакцию на 3+2% за уровень навыка. Максимальный шанс парирования становится 70%."
		}, {
			"name": "Боевая грация",
			"id": "battlegraceSkills",
			"iconUrl": "",
			"type": "defence",
			"contentNoob": "После каждого промаха врагов по аватару, парирования и уклонения от заклинаний добавляет 5% накопленных ОД (от базового ОД на действие) за уровень навыка. Накопление ОД зависит от урона врага (100% при уроне равном 10% от максимального здоровья аватара). При этом количество добавляемых ОД не может превышать 1 ОД за каждый уровень навыка.",
			"contentExpert": "После каждого промаха врагов по аватару, парирования и уклонения от заклинаний добавляет 6% накопленных ОД (от базового ОД на действие) за уровень навыка. Накопление ОД зависит от урона врага (100% при уроне равном 10% от максимального здоровья аватара). При этом количество добавляемых ОД не может превышать 1 ОД за каждый уровень навыка.",
			"contentMaster": "После каждого промаха врагов по аватару, парирования и уклонения от заклинаний добавляет 10% накопленных ОД (от базового ОД на действие) за уровень навыка. Накопление ОД зависит от урона врага (100% при уроне равном 10% от максимального здоровья аватара). При этом количество добавляемых ОД не может превышать 2 ОД за каждый уровень навыка."
		}, {
			"name": "Сокрушение",
			"id": "afflictionSkills",
			"iconUrl": "",
			"type": "atack",
			"contentNoob": "Повышает пробой брони на 10+1% единицы за уровень навыка, при использовании как контактного, так и стрелкового оружия.",
			"contentExpert": "Повышает пробой брони на 15+2% единицы за уровень навыка, при использовании как контактного, так и стрелкового оружия. Повышает урон щиту брони на 2% за уровень навыка.",
			"contentMaster": "Повышает пробой брони на 40+3% единицы за уровень навыка, при использовании как контактного, так и стрелкового оружия. Повышает урон щиту брони на 3% за уровень навыка."
		}, {
			"name": "Разрушитель",
			"secondName": "Хозяин стихий",
			"id": "destroyerSkills",
			"iconUrl": "",
			"type": "magic",
			"contentNoob": "Повышает разрушитель на 10 за каждый уровень навыка.",
			"contentExpert": "Повышает разрушитель на 12 за каждый уровень навыка. Повышает урон, наносимый монстрам на 20%.",
			"contentMaster": "Повышает разрушитель на 15 за каждый уровень навыка. Повышает урон, наносимый монстрам на 40%."
		}, {
			"name": "Призыватель",
			"secondName": "Темный кардинал",
			"id": "summonerSkills",
			"iconUrl": "",
			"type": "magic",
			"contentNoob": "Повышает призыватель на 10 за уровень навыка.",
			"contentExpert": "Повышает призыватель на 12 за уровень навыка. Снижает их ОД на действие на 10%.",
			"contentMaster": "Повышает призыватель на 15 за уровень навыка. Снижает их ОД на действие на 15%."
		}, {
			"name": "Заклинатель",
			"secondName": "Воля и разум",
			"id": "casterSkills",
			"iconUrl": "",
			"type": "magic",
			"contentNoob": "Увеличивает заклинатель на 10 за уровень навыка.",
			"contentExpert": "Увеличивает заклинатель на 12 за уровень навыка.",
			"contentMaster": "Увеличивает заклинатель на 16 за уровень навыка."
		}, {
			"name": "Аура сопротивления",
			"secondName": "Аура чистоты",
			"id": "resistauraSkills",
			"iconUrl": "",
			"type": "defence",
			"contentNoob": "Повышает сопротивление аватара на 10+2% и щит сопротивления на 1% за уровень навыка.",
			"contentExpert": "Повышает сопротивление аватара на 20+2% и щит сопротивления на 1%, снижает отраженный урон и урон от ожогов на 1% за каждый уровень навыка.",
			"contentMaster": "Повышает сопротивление аватара на 30+3% и щит сопротивления на 2%, снижает отраженный урон, урон от ожогов и временный урон на 1.6% за каждый уровень навыка."
		}, {
			"name": "Устойчивость",
			"id": "sustainabilitySkills",
			"iconUrl": "",
			"type": "defence",
			"contentNoob": "Снижает вероятность получения критического удара при успешной атаке противника на 5+2% за каждый уровень навыка.",
			"contentExpert": "Снижает вероятность получения критического удара при успешной атаке противника на 10+2% за каждый уровень навыка.",
			"contentMaster": "Снижает вероятность получения критического удара при успешной атаке противника на 20+4% за каждый уровень навыка."
		}, {
			"name": "Грузоподъемность",
			"id": "carryingSkills",
			"iconUrl": "",
			"type": "forAll",
			"contentNoob": "Повышает максимальный переносимый вес на 1000+10% за каждый уровень навыка.",
			"contentExpert": "Повышает максимальный переносимый вес на 2000+10% за каждый уровень навыка.",
			"contentMaster": "Повышает максимальный переносимый вес на 3000+20% за каждый уровень навыка."
		}, {
			"name": "Тайные знания",
			"id": "secretknowledgeSkills",
			"iconUrl": "",
			"type": "magic",
			"contentNoob": "Повышает количество маны аватара на 20+2% за уровень навыка.",
			"contentExpert": "Повышает количество маны аватара на 50+2% за уровень навыка.",
			"contentMaster": "Повышает количество маны аватара на 100+3% за уровень навыка."
		}, {
			"name": "Алхимический активатор",
			"id": "alchactiveSkills",
			"iconUrl": "",
			"type": "alchemy",
			"contentNoob": "Повышает прямой урон боевых алхимических зелий на 11% за уровень навыка.",
			"contentExpert": "Повышает прямой урон боевых алхимических зелий на 13% за уровень навыка. Урон алхимических зелий игнорирует 40% сопротивляемости целей.",
			"contentMaster": "Повышает прямой урон боевых алхимических зелий на 17% за уровень навыка. Урон алхимических зелий игнорирует 50% сопротивляемости целей."
		}, {
			"name": "Алхимический ингибитор",
			"id": "alchingibSkills",
			"iconUrl": "",
			"type": "alchemy",
			"contentNoob": "Увеличивает продолжительность временных эффектов накладываемых боевыми алхимическими зельями и эффективность их лечения на 12% за уровень навыка.",
			"contentExpert": "Увеличивает продолжительность временных эффектов накладываемых боевыми алхимическими зельями и эффективность их лечения на 14% за уровень навыка.",
			"contentMaster": "Увеличивает продолжительность временных эффектов накладываемых боевыми алхимическими зельями и эффективность их лечения на 20% за уровень навыка."
		}, {
			"name": "Алхимический стабилизатор",
			"id": "alchstabilitySkills",
			"iconUrl": "",
			"type": "alchemy",
			"contentNoob": "Снижает алхимическую усталость на 1, уменьшает расход маны на использование алхимических зелий и увеличивает урон, силу лечения и длительность эффектов алхимических реакций на 2% за уровень навыка.",
			"contentExpert": "Снижает алхимическую усталость на 1, уменьшает расход маны на использование алхимических зелий и увеличивает урон, силу лечения и длительность эффектов алхимических реакций на 3% за уровень навыка. Дает шанс равный 1% за уровень навыка сохранить алхимическое зелье при его использовании.",
			"contentMaster": "Снижает алхимическую усталость на 1, уменьшает расход маны на использование алхимических зелий и увеличивает урон, силу лечения и длительность эффектов алхимических реакций на 4% за уровень навыка. Дает шанс равный 2% за уровень навыка сохранить алхимическое зелье при его использовании."
		}, {
			"name": "Владение кловерами",
			"id": "gloverSkills",
			"iconUrl": "",
			"type": "alchemy",
			"contentNoob": "Каждый уровень навыка увеличивает наносимый кловерами урон на 2%.",
			"contentExpert": "Каждый уровень навыка увеличивает наносимый кловерами урон на 3%. Увеличивает силу лечения и продолжительность временных эффектов накладываемых боевыми алхимическими зельями на себя на 20%.",
			"contentMaster": "Каждый уровень навыка увеличивает наносимый кловерами урон на 4% и дополнительно повышает урон на 20 (за каждый уровень навыка). Увеличивает силу лечения и продолжительность временных эффектов накладываемых боевыми алхимическими зельями на себя на 50%."
		}, {
			"name": "Дуэлянт",
			"id": "duelistSkills",
			"iconUrl": "",
			"type": "atack",
			"contentNoob": "Увеличивает урон оружия на 7 + 1% и парирование на 2 + 1% за уровень навыка. Работает только если используется одно одноручное оружие без щита.",
			"contentExpert": "Увеличивает урон оружия на 7 + 1%, парирование на 2 + 1% и реакцию на 2 + 1% за уровень навыка. Работает только если используется одно одноручное оружие без щита.",
			"contentMaster": "Увеличивает урон оружия на 7 + 1%, парирование на 2 + 1%, реакцию на 2 + 1%, пробой брони на 6 + 1% и атаку на 9 + 1% за уровень навыка. Работает только если используется одно одноручное оружие без щита."
		}, {
			"name": "Воитель",
			"id": "warSkills",
			"iconUrl": "",
			"type": "defence",
			"contentNoob": "Увеличивает прирост ярости на 3% за уровень навыка.",
			"contentExpert": "Увеличивает прирост ярости и здоровье на 3% за уровень навыка.",
			"contentMaster": "Увеличивает прирост ярости и здоровье на 3% за уровень навыка. Увеличивает поглощение урона (снижает магический и физический урон) на 1% за уровень навыка."
		}, {
			"name": "Магия веры",
			"id": "praySkills",
			"iconUrl": "",
			"type": "magic",
			"contentNoob": "Магия веры позволяет усиливать себя за счет печатей, благословений и молитв. Позволяет изучать базовые печати, благословения и молитвы. Увеличивает веру на 1 за уровень навыка.",
			"contentExpert": "Позволяет изучать экспертные печати, благословения и молитвы. Увеличивает веру на 1 за уровень навыка.",
			"contentMaster": "Позволяет изучать мастерские печати, благословения и молитвы. Увеличивает веру на 1 за уровень навыка."
		}, {
			"name": "Магия чумы",
			"id": "defilerSkills",
			"iconUrl": "",
			"type": "magic",
			"contentNoob": "Новичок: Магия отравлений и болезней. Повышает осквернитель на 2 за уровень навыка. Позволяет изучать базовые заклинания школы.",
			"contentExpert": "Эксперт: Повышает осквернитель на 2 за уровень навыка. Позволяет изучать экспертные заклинания и дополнительно повышает осквернитель на 10. Повышает урон отравлений, наносимый монстрам на 20%.",
			"contentMaster": "Мастер: Повышает осквернитель на 2 за уровень навыка. Позволяет изучать мастерские заклинания и дополнительно повышает осквернитель на 20. Повышает урон отравлений, наносимый монстрам на 40%."
		}, {
			"name": "Паладин",
			"id": "palSkills",
			"iconUrl": "",
			"type": "magic",
			"contentNoob": "Увеличивает длительность печатей, благословений и молитв и снижает расход маны на их использование на 1% за уровень навыка. Увеличивает веру на 1 за уровень навыка.",
			"contentExpert": "Увеличивает длительность печатей, благословений и молитв и снижает расход маны на их использование на 2% за уровень навыка. Увеличивает веру на 1 за уровень навыка.",
			"contentMaster": "Увеличивает длительность печатей, благословений и молитв и снижает расход маны на их использование на 2% за уровень навыка. Позволяет одновременно накладывать 2 печати, 2 благословения и 2 молитвы. Увеличивает веру на 1 за уровень навыка."
		}, {
			"name": "Монах",
			"id": "monkSkills",
			"iconUrl": "",
			"type": "magic",
			"contentNoob": "Увеличивает веру на 3 за уровень навыка.",
			"contentExpert": "Увеличивает веру на 4 за уровень навыка.",
			"contentMaster": "Увеличивает веру на 5 за уровень навыка."
		}, {
			"name": "Ядомансер",
			"id": "posionSkills",
			"iconUrl": "",
			"type": "magic",
			"contentNoob": "Повышает осквернитель на 10 за каждый уровень навыка.",
			"contentExpert": "Повышает осквернитель на 12 за каждый уровень навыка. Повышает урон отравлений, наносимый монстрам на 20%.",
			"contentMaster": "Повышает осквернитель на 15 за каждый уровень навыка. Повышает урон отравлений, наносимый монстрам на 40%."
		}, {
			"name": "Чумной доктор",
			"id": "plagueDoctorSkills",
			"iconUrl": "",
			"type": "magic",
			"contentNoob": "Увеличивает продолжительность болезней и силу призываемых крыс на 10%.",
			"contentExpert": "Увеличивает продолжительность болезней и силу призываемых крыс на 12%. Болезни, кроме основной цели, также накладываются на другого случайного врага.",
			"contentMaster": "Увеличивает продолжительность болезней и силу призываемых крыс на 15%. Все крысы накладывают отравление (100 + осквернитель * 0.7) / 60 при успешных атаках."
		}, {
			"name": "Путь ветра",
			"id": "windWaySkills",
			"iconUrl": "",
			"type": "defence",
			"contentNoob": "Повышает шанс уклонения на 1% за уровень навыка.",
			"contentExpert": "Повышает шанс уклонения на 1%, шанс уклонения от ударной магии и шанс контрудара на 1% за уровень навыка.",
			"contentMaster": "Повышает шанс уклонения на 1.2%, шанс уклонения от ударной магии на 1% и шанс контрудара на 2% за уровень навыка."
		}, {
			"name": "Фехтовальщик",
			"id": "swordsmanSkills",
			"iconUrl": "",
			"type": "atack",
			"contentNoob": "Повышает атаку на 10 + 1% и защиту на 10 + 1% за уровень навыка.",
			"contentExpert": "Повышает атаку на 20 + 1%, защиту на 20 + 1% и шанс контрудара на 1% за уровень навыка.",
			"contentMaster": "Повышает атаку на 20 + 1%, защиту на 30 + 2% и шанс контрудара на 2% за уровень навыка."
		}, {
			"name": "Снайпер",
			"id": "sniperSkill",
			"iconUrl": "",
			"type": "atack",
			"contentNoob": "Повышает урон стрелковых атак на 4+0.3% за уровень за метку на цели.",
			"contentExpert": "Повышает урон стрелковых атак на 5+0.4% за уровень за метку на цели.",
			"contentMaster": "Повышает урон стрелковых атак на 6+0.5% за уровень за метку на цели."
		}, {
			"name": "Застрельщик",
			"id": "shooterSkills",
			"iconUrl": "",
			"type": "atack",
			"contentNoob": "Физический урон врагов, имеющих метки, по аватару снижается на 0.1% за уровень за метку на враге. При снятии меток с цели восстанавливает 7 здоровья за уровень за каждую снятую метку.",
			"contentExpert": "Физический урон врагов, имеющих метки, по аватару снижается на 0.15% за уровень за метку на враге. При снятии меток с цели восстанавливает 10 здоровья за уровень за каждую снятую метку. Максимум меток на цели +1.",
			"contentMaster": "Физический урон врагов, имеющих метки, по аватару снижается на 0.2% за уровень за метку на враге. При снятии меток с цели восстанавливает 10+0.03% здоровья за уровень за каждую снятую метку. Максимум меток на цели +2."
		}];

export default skillsSummary;


//var skillsSummary = []
//for (var i = 0; i<document.getElementsByTagName('td')[4].innerHTML.split('<br><br>').length-1; i++) {
//	var v = document.getElementsByTagName('td')[4].innerHTML.split('<br><br>')[i].split('</font></b></li><b>')
//	v[0] = v[0].replace('<li> <b><font color="white">', '')
//	v[0] = v[0].replace('				', '')
//	
//	
//	var f = v[1].split('<br><b>')
//
//	f[0] = f[0].replace('Новичок:</b> ', '')
//    f[1] = f[1].replace('Эксперт:</b> ', '')
//    f[2] = f[2].replace('Мастер:</b> ', '')
//
//	skillsSummary.push({
//				name: v[0],
//				id: '',
//				iconUrl: '',
//				type: '',
//				contentNoob: f[0],
//				contentExpert: f[1],
//				contentMaster: f[2],
//    })
//	console.log(f)
//}
//var kindOfThing = 'Мечи'
//var allItems = []
//// Все предметы
//var x = document.getElementsByClassName('itemInfoTable')
//
//
//for (var i = 0; i < x.length; i++) {
//	var name = x[i].getElementsByClassName('itemInfoNameLink')[0].textContent
//
//	var lvl = x[i].getElementsByTagName('span')[2].textContent
//	var prochka = x[i].getElementsByTagName('span')[3].textContent.split('/')[0]
//	var wight = x[i].getElementsByTagName('span')[4].textContent
//
//	var costType = x[i].getElementsByTagName('span')[5].title
//	var cost = x[i].getElementsByTagName('span')[5].textContent
//
//	var imgUrl = x[i].getElementsByTagName('img')[4].src
//
//	var needPower = 0;
//	var needTel = 0;
//	var needDex = 0;
//
//
//	var powerItem = 0;
//	var teloItem = 0;
//	var dexItem = 0;
//
//	var vinoItem = 0;
//	var voliaItem = 0;
//	var intellItem = 0;
//
//	var par = {}
//	par['урон'] = [0, 0]
//	par['ОД на действие'] = 0
//	par['здоровье'] = 0
//	par['мана'] = 0
//	par['атака'] = 0
//	par['защита'] = 0
//	par['броня'] = 0
//	par['пробой брони'] = 0
//	par['устойчивость'] = 0
//	par['ОД макс.'] = 0
//	par['реакция'] = 0
//	par['восстановление маны'] = 0
//	par['восстановление здоровья'] = 0
//	par['крит. удар'] = 0
//	par['сопротивление'] = 0
//	par['парирование'] = 0
//	par["разрушитель"] = 0
//    par["заклинатель"] = 0
//    par["призыватель"] = 0
//	
//	var complect = 'Нет'
//	
//	
//	
//	// Требования
//	//	var tr = x[i].getElementsByTagName('tr')[2].getElementsByTagName('td')[1].innerHTML.split('<br>')[0].split(', ')
//
//	var trr = x[i].getElementsByTagName('tr')[2].getElementsByTagName('td')[1].innerHTML.split('<br>')
//
//
//	for (var g = 0; g < trr.length; g++) {
//		if (trr[g].indexOf('Требования') != -1) {
//
//			var tr = trr[g].split(', ')
//
//			for (var j = 0; j < tr.length; j++) {
//				if (tr[j].indexOf('сила') != -1) {
//					needPower = tr[j].split('<span>')[tr[j].split('<span>').length - 1].replace('</span>', '')*1
//				}
//				if (tr[j].indexOf('телосложение') != -1) {
//					needTel = tr[j].split('<span>')[tr[j].split('<span>').length - 1].replace('</span>', '')*1
//				}
//				if (tr[j].indexOf('ловкость') != -1) {
//					needDex = tr[j].split('<span>')[tr[j].split('<span>').length - 1].replace('</span>', '')*1
//				}
//			}
//		}
//		if (trr[g].indexOf('Характеристики') != -1) {
//
//
//
//			// Характеристики, добавляемые вещью
//
//
//
//			var tr = trr[g].split(', ')
//			for (var j = 0; j < tr.length; j++) {
//
//				if (tr[j].indexOf('сила') != -1) {
//					powerItem = tr[j].split('сила')[1] * 1
//				}
//				if (tr[j].indexOf('телосложение') != -1) {
//					teloItem = tr[j].split('телосложение')[1] * 1
//				}
//				if (tr[j].indexOf('ловкость') != -1) {
//					dexItem = tr[j].split('ловкость')[1] * 1
//				}
//				if (tr[j].indexOf('выносливость') != -1) {
//					vinoItem = tr[j].split('выносливость')[1] * 1
//				}
//				if (tr[j].indexOf('воля') != -1) {
//					voliaItem = tr[j].split('воля')[1] * 1
//				}
//				if (tr[j].indexOf('интеллект') != -1) {
//					intellItem = tr[j].split('интеллект')[1] * 1
//				}
//			}
//		}
//		if (trr[g].indexOf('Параметры') != -1) {
//
//
//
//			// Характеристики, добавляемые вещью
//
//
//
//			var tr = trr[g].split(', ')
//			for (var j = 0; j < tr.length; j++) {
//
//
//				var n = 'урон'
//				if (tr[j].indexOf(n) != -1) {
////					par[n] = tr[j].split(n)[1] * 1
////					console.log(tr[j].split(n)[1])
//					
//					par[n] = [tr[j].split(n)[1].split('-')[0].replace('&nbsp;', '') * 1, tr[j].split(n)[1].split('-')[1].replace('&nbsp;', '') * 1]
//				}
//				
//				var n = 'ОД на действие'
//				if (tr[j].indexOf(n) != -1) {
//					par[n] = tr[j].split(n)[1].replace('+-', '-')*1
//				}
//				
//				var n = 'здоровье'
//				if (tr[j].indexOf(n) != -1) {
//					par[n] = tr[j].split(n)[1].replace('+-', '-')*1
//				}
//				
//				var n = 'мана'
//				if (tr[j].indexOf(n) != -1) {
//					par[n] = tr[j].split(n)[1].replace('+-', '-')*1
//				}
//				var n = 'атака'
//				if (tr[j].indexOf(n) != -1) {
//					par[n] = tr[j].split(n)[1].replace('+-', '-')*1
//				}
//				
//				var n = 'защита'
//				if (tr[j].indexOf(n) != -1) {
//					
////					console.log(tr[j].split(n)[1])
//					par[n] = tr[j].split(n)[1].replace('+-', '-')*1
//				}
//				
//				var n = 'броня'
//				if (tr[j].indexOf(n) != -1) {
//					par[n] = tr[j].split(n)[1].replace('+-', '-')*1
//				}
//				
//				var n = 'пробой брони'
//				if (tr[j].indexOf(n) != -1) {
//					par[n] = tr[j].split(n)[1].replace('+-', '-')*1
//				}
//				var n = 'устойчивость'
//				if (tr[j].indexOf(n) != -1) {
//					par[n] = tr[j].split(n)[1].replace('+-', '-')*1
//				}
//				
//				var n = 'ОД макс.'
//				if (tr[j].indexOf(n) != -1) {
//					par[n] = tr[j].split(n)[1].replace('+-', '-')*1
//				}
//				
//				var n = 'реакция'
//				if (tr[j].indexOf(n) != -1) {
//					par[n] =tr[j].split(n)[1].replace('+-', '-')*1
//				}
//				
//				var n = 'восстановление маны'
//				if (tr[j].indexOf(n) != -1) {
//					par[n] = tr[j].split(n)[1].replace('+-', '-')*1
//				}
//				var n = 'восстановление здоровья'
//				if (tr[j].indexOf(n) != -1) {
//					par[n] = tr[j].split(n)[1].replace('+-', '-')*1
//				}
//				
//				var n = 'крит. удар'
//				if (tr[j].indexOf(n) != -1) {
//					par[n] =tr[j].split(n)[1].replace('+-', '-')*1
//				}
//				
//				var n = 'сопротивление'
//				if (tr[j].indexOf(n) != -1) {
//					par[n] = tr[j].split(n)[1].replace('+-', '-')*1
//				}
//				
//				var n = 'парирование'
//				if (tr[j].indexOf(n) != -1) {
//					par[n] = tr[j].split(n)[1].replace('+-', '-')*1
//				}
//				var n = 'призыватель'
//				if (tr[j].indexOf(n) != -1) {
//					par[n] = tr[j].split(n)[1].replace('+-', '-').replace('%', '')*1/100
//				}
//				
//				var n = 'заклинатель'
//				if (tr[j].indexOf(n) != -1) {
//					par[n] = tr[j].split(n)[1].replace('+-', '-').replace('%', '')*1/100
//				}
//				
//				var n = 'разрушитель'
//				if (tr[j].indexOf(n) != -1) {
//					par[n] = tr[j].split(n)[1].replace('+-', '-').replace('%', '')*1/100
//				}
//
//			}
//
//		}
//		if (trr[g].indexOf('Комплект') != -1) {
//
//
//
//			complect = trr[g].split('вещей">')[1].replace('</span>', '').trim()
//
//		}
//
//	}
//
//
//
//	// Тип вещи
//	var typeThing = 'Нет'
//	var additionalName = ''
//	if ((needPower > needTel) && (needPower > needDex)) {
//		typeThing = 'Силовик'
//		additionalName = 'Сила'
//	}
//
//	if ((needTel > needPower) && (needTel > needDex)) {
//		typeThing = 'Танк'
//		
//		additionalName = 'Тело'
//	}
//	if ((needDex > needPower) && (needDex > needTel)) {
//		typeThing = 'Ловкость'
//		
//		additionalName = 'Ловкость'
//	}
//	
//	if ((intellItem > needPower) && (intellItem > needTel)) {
//		typeThing = 'Маг'
//		if (par["призыватель"] > par["заклинатель"]) {
//			additionalName = 'Тьма'
//		}
//		if (par["заклинатель"] > par["призыватель"]) {
//			additionalName = 'Свет'
//		}
//		if (par["разрушитель"] > par["призыватель"]) {
//			additionalName = 'Стихия'
//		}
//	}
//
//
//	// параметры
//	console.log(complect)
//	if (lvl == 70) {
//
//	allItems.push({
//		
//		name: name + ' ' + additionalName,
//		typeThing: typeThing,
//		kindOfThing: kindOfThing,
//		
//		needlvl: lvl,
//		durability: prochka,
//		weight: wight,
//		
//		costType: costType,
//		cost: cost,
//		
//		imgUrl: imgUrl,
//		
//		needPower: needPower,
//		needBody: needTel,
//		needDex: needDex,
//		
//		powerItem: powerItem,
//		bodyItem: teloItem,
//		dexItem: dexItem,
//		
//		staminaItem: vinoItem,
//		willItem: voliaItem,
//		intellItem: intellItem,
//		
//		parametrs: par,
//		complect: complect,
//	})
//    }
//}